Repository: MakiOmar/WooCommerce-Saudi-Arabia-national-address
Catalog: languages/saudi-address-woocommerce-*.po
Languages: ar

source: Saudi Address for WooCommerce requires WooCommerce to be installed and active.
ar: يتطلب إضافة Saudi Address for WooCommerce تثبيت وتفعيل WooCommerce.

source: Loading...
ar: جاري التحميل...

source: Select Region
ar: اختر المنطقة

source: Select City
ar: اختر المدينة

source: Select District
ar: اختر الحي

source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.

source: Saudi National Address
ar: العنوان الوطني السعودي

source: Region
ar: المنطقة

source: City
ar: المدينة

source: District
ar: الحي

source: Building Number
ar: رقم المبنى

source: Enter building number
ar: أدخل رقم المبنى

source: Postal Code
ar: الرمز البريدي

source: Enter postal code
ar: أدخل الرمز البريدي

source: Additional Number
ar: الرقم الإضافي

source: Enter additional number
ar: أدخل الرقم الإضافي

source: Street
ar: الشارع

source: Enter street name
ar: أدخل اسم الشارع

source: Unit Number
ar: رقم الوحدة

source: Enter unit number (optional)
ar: أدخل رقم الوحدة (اختياري)

source: Postal code must be 5 digits.
ar: يجب أن يكون الرمز البريدي 5 أرقام.

source: Building number must be numeric.
ar: يجب أن يكون رقم المبنى رقماً.

source: Additional number must be numeric.
ar: يجب أن يكون الرقم الإضافي رقماً.

source: Saudi Address Settings
ar: إعدادات العنوان السعودي

source: Saudi Address
ar: العنوان السعودي

source: API URL
ar: رابط API

source: The Saudi National Address API URL. Default: https://apina.address.gov.sa/NationalAddress/v3.1
ar: رابط API للعنوان الوطني السعودي. الافتراضي: https://apina.address.gov.sa/NationalAddress/v3.1

source: API Key
ar: مفتاح API

source: Get your API key from %s
ar: احصل على مفتاح API من %s

source: Enable Saudi Address
ar: تفعيل العنوان السعودي

source: Enable Saudi address fields on checkout
ar: تفعيل حقول العنوان السعودي في صفحة الدفع

source: Required Fields
ar: الحقول المطلوبة

source: Make Saudi address fields required
ar: جعل حقول العنوان السعودي مطلوبة

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Language for API responses
ar: لغة استجابات API

source: Verify Address
ar: التحقق من العنوان

source: Verify address using API before checkout
ar: التحقق من العنوان باستخدام API قبل الدفع

source: This will verify the address using the Saudi National Address API before allowing checkout completion.
ar: سيتم التحقق من العنوان باستخدام API العنوان الوطني السعودي قبل السماح بإتمام الدفع.

source: Field Settings
ar: إعدادات الحقول

source: Choose which fields to display on the checkout page.
ar: اختر الحقول التي تريد عرضها في صفحة الدفع.

source: Available Fields
ar: الحقول المتاحة

source: API Test
ar: اختبار API

source: Test your API configuration by clicking the button below.
ar: اختبر إعدادات API بالنقر على الزر أدناه.

source: Test API Connection
ar: اختبار اتصال API

source: Security check failed
ar: فشل فحص الأمان

source: Failed to load cities
ar: فشل في تحميل المدن

source: Failed to load districts
ar: فشل في تحميل الأحياء

source: Address verified successfully
ar: تم التحقق من العنوان بنجاح

source: Address verification failed
ar: فشل التحقق من العنوان

source: You do not have sufficient permissions
ar: ليس لديك الصلاحيات الكافية

source: API is not configured. Please set your API key.
ar: API غير مُعد. يرجى تعيين مفتاح API.

source: API connection successful!
ar: تم الاتصال بـ API بنجاح!

source: API connection failed. Please check your API key and URL.
ar: فشل الاتصال بـ API. يرجى التحقق من مفتاح API والرابط.
